duxinglang-1/nRF9160_test/E2_V3_TEST/src/uart_ble/uart_ble.c
	if(uart_ble_is_waked)
		return;

	pm_device_action_run(uart_ble, PM_DEVICE_ACTION_RESUME);
	uart_ble_is_waked = true;

#ifdef UART_DEBUG
	LOGD("uart ble set active success!");
#endif
}

void uart_ble_sleep_in(void)
{	
	if(!uart_ble_is_waked)
		return;

	pm_device_action_run(uart_ble, PM_DEVICE_ACTION_SUSPEND);
	uart_ble_is_waked = false;

#ifdef UART_DEBUG
	LOGD("uart ble set low power success!");
#endif
}

static void ble_interrupt_event(struct device *interrupt, struct gpio_callback *cb, uint32_t pins)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif
	uart_ble_wake_flag = true;
}

static void UartBleSleepInCallBack(struct k_timer *timer_id)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif
	uart_ble_sleep_flag = true;
}
#endif

static void GetBLEInfoCallBack(struct k_timer *timer_id)
{
	get_ble_info_flag = true;
}

void ble_init(void)
{
	gpio_flags_t flag = GPIO_INPUT|GPIO_PULL_UP;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	uart_ble = device_get_binding(BLE_DEV);
	if(!uart_ble)
	{
	#ifdef UART_DEBUG
		LOGD("Could not get %s device", BLE_DEV);
	#endif
		return;
	}

	uart_irq_callback_set(uart_ble, uart_cb);
	uart_irq_rx_enable(uart_ble);

	gpio_ble = device_get_binding(BLE_PORT);
	if(!gpio_ble)
	{
	#ifdef UART_DEBUG
		LOGD("Could not get %s port", BLE_PORT);
	#endif
		return;
	}	
	gpio_pin_configure(gpio_ble, BLE_WAKE_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_ble, BLE_WAKE_PIN, 0);

#ifdef CONFIG_PM_DEVICE
	gpio_pin_configure(gpio_ble, BLE_INT_PIN, flag);
	gpio_pin_interrupt_configure(gpio_ble, BLE_INT_PIN, GPIO_INT_DISABLE);
	gpio_init_callback(&gpio_cb, ble_interrupt_event, BIT(BLE_INT_PIN));
	gpio_add_callback(gpio_ble, &gpio_cb);
	gpio_pin_interrupt_configure(gpio_ble, BLE_INT_PIN, GPIO_INT_ENABLE|GPIO_INT_EDGE_FALLING);	
	k_timer_start(&uart_ble_sleep_in_timer, K_SECONDS(UART_BLE_WAKE_HOLD_TIME_SEC), K_NO_WAIT);
#endif

	k_timer_start(&get_ble_info_timer, K_SECONDS(2), K_NO_WAIT);
}

void UartMsgProc(void)
{
#ifdef CONFIG_PM_DEVICE
	if(uart_ble_wake_flag)
	{
		uart_ble_wake_flag = false;
		uart_ble_sleep_out();
	}

	if(uart_ble_sleep_flag)
	{
		uart_ble_sleep_flag = false;
		uart_ble_sleep_in();
	}
#endif/*CONFIG_PM_DEVICE*/

	if(uart_send_flag)
	{
		uart_send_data_handle();
		uart_send_flag = false;
	}
	if(redraw_blt_status_flag)
	{
		IdleShowBleStatus(g_ble_connected);
		redraw_blt_status_flag = false;
	}
	if(get_ble_info_flag)
	{
		static uint8_t index = 0;

		if(index == 0)
		{
			index = 1;
			MCU_get_nrf52810_ver();
			k_timer_start(&get_ble_info_timer, K_MSEC(100), K_NO_WAIT);
		}
		else
		{
			MCU_get_ble_mac_address();
		}
		
		get_ble_info_flag = false;
	}
}

void test_uart_ble(void)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif

	while(1)
	{
		ble_send_date_handle("Hello World!\n", strlen("Hello World!\n"));
		k_sleep(K_MSEC(1000));
	}
}
